4. external_flow/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
(-0.25 -0.25 -0.25)
(1.5 -0.25 -0.25)
(1.5 0.25 -0.25)
(-0.25 0.25 -0.25)

(-0.25 -0.25 0.25)
(1.5 -0.25 0.25)
(1.5 0.25 0.25)
(-0.25 0.25 0.25)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (150 80 80) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

inlet
{
type patch;
faces
(
(0 4 7 3)
);
}

outlet
{
type patch;
faces
(
(1 2 6 5)
);
}

top
{
type wall;
faces
(
(3 7 6 2)
);
}

bottom
{
type wall;
faces
(
(0 1 5 4)
);
}

side1
{
type wall;
faces
(
(0 3 2 1)
);
}

side2
{
type wall;
faces
(
(4 5 6 7)
);
}

);

mergePatchPairs
(
);

