4. external_flow/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap true;
addLayers true;

geometry
{
    corpo
    {
        type triSurfaceMesh;
        file "corpo.stl";
    }
}

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 0;
    
    nCellsBetweenLevels 6;

    features ();

    refinementSurfaces
    {
        corpo
        {
            level (1 1);
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
{
    wake
    {
        mode box;
        levels ((1E15 2));
    }
}

    locationInMesh (1 0 0);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
        corpo
        {
            nSurfaceLayers 2;
        }
    }

    expansionRatio 1.2;

    finalLayerThickness 0.5;

    minThickness 0.1;

    nGrow 0;

    featureAngle 60;

    nRelaxIter 5;

    nSmoothSurfaceNormals 3;
    nSmoothNormals 3;
    nSmoothThickness 10;

    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;

    minMedianAxisAngle 90;

    nBufferCellsNoExtrude 0;

    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;

    maxBoundarySkewness 20;
    maxInternalSkewness 4;

    maxConcave 80;

    minVol 1e-13;
    minTetQuality 1e-30;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;

    minTriangleTwist -1;

    nSmoothScale 4;
    errorReduction 0.75;
}

mergeTolerance 1e-6;
