4. external_flow/0/k
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object k;
}

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0.01;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 0.01;
    }

    outlet
    {
        type zeroGradient;
    }

    top
    {
        type slip;
    }

    bottom
    {
        type slip;
    }

    side1
    {
        type slip;
    }

    side2
    {
        type slip;
    }

    corpo
    {
        type kqRWallFunction;
        value uniform 0;
    }
}

