4. external_flow/0/omega
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object omega;
}

dimensions [0 0 -1 0 0 0 0];

internalField uniform 10;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 10;
    }

    outlet
    {
        type zeroGradient;
    }

    top
    {
        type slip;
    }

    bottom
    {
        type slip;
    }

    side1
    {
        type slip;
    }

    side2
    {
        type slip;
    }

    corpo
    {
        type omegaWallFunction;
        value uniform 10;
    }
}

