4. external_flow/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    side1
    {
        type            calculated;
        value           uniform 0;
    }
    side2
    {
        type            calculated;
        value           uniform 0;
    }
    corpo
    {
        type            calculated;
        value           nonuniform List<scalar> 
1741
(
5.97811
4.73476
4.78598
7.06809
7.43573
12.9046
7.16846
7.65704
...
)
;
    }
}


// ************************************************************************* //
