4. external_flow/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

surfaces
(
    "corpo.stl"
);

includedAngle 150;

writeObj yes;
